{"title":"About","body":"<p>CAPE.io is a web service that lets curators use content created anywhere and publish it everywhere. Anything that has a feed, API or webhook becomes a content source (API) feeding your data-pool (Model). Content streams in from Facebook, Twitter, Instagram, Flickr, Youtube, Zapier, Dropbox, Github and other Websites. CAPE.io is an aggregator, filtering, and rendering engine for utilizing the data sources (API&#39;s) easily. It then allows you to create new feeds and/or content sources for use on your website or potentially any app.</p> <p>Think the wordpress.com for Jekyll with more power than Drupal without being limited to a single data source. For example, a user links social media websites with CAPE and sees a website automatically generated based on the information and content available from those sources. A &quot;newspaper&quot; will manually or automatically compile a collection of content from various sources and pass it through templates making it ready print, web, mobile, and syndicates.</p> <p>Feeds and moderation. </p> <p>Four steps of content life cycle Authoring Storage, Organization, Compilation Delivery Consumption</p> <p>Step 2 should be all about search. Building saved searches that get used on different areas of the site. A search is really just a list of filters.</p> <p>Two types of lists. Smart and Static.</p> <p>Steps to CAPE.io Define sources Send source content to search index Create filters. This creates a &quot;Feed&quot;. Each feed has two status filters. Added, Removed. Each feed has a single &quot;Live&quot; list that is based on a combination of &quot;is&quot; or &quot;is not&quot; for Added and Removed. For example: added, not_added+not_removed,not_removed. When new results are found on the live list the compiler is called. Web pages are also a list. A list of lists. Assign lists to a token. Iterate through tokens to build HTML page. Web sections can be created from a list and generate pages and pass arguments to individual pages.</p> <ol> <li>Content creation. Pen and paper, typewriter, word processor, twitter, Facebook, youtube.</li> <li>Content management. Filing cabinet, computer folders, wordpress, drupal.</li> <li>Content delivery. Post office, magazines, newspaper, PHP Apache, CDN.</li> </ol> <p>CAPE handles various content creation repositories. Each piece of content is a content object.</p> <h2 id=\"cape-io-is-for-content-curation\">CAPE.io is for Content Curation</h2> <p>Assemble content from anywhere.</p> <ol> <li>Define your content sources.</li> <li>Create a set of filters.</li> <li>Preview the results.</li> <li>Save the final query.</li> <li>Optionally save and remove results from the list.</li> <li>Optionally set a specific order to the results or define a sort.</li> <li>Optionally create or select mustache templates to pass results to.</li> <li>Optionally define where the results should be pushed/saved to.</li> </ol> <h2 id=\"content-sources\">Content Sources</h2> <ul> <li>Instagram<ul> <li>Each search filter needs to be added to the real-time list and auto-added.</li> </ul> </li> <li>Flickr</li> <li>Facebook - <a href=\"https://developers.facebook.com/apps/301954979862828/realtime/\">https://developers.facebook.com/apps/301954979862828/realtime/</a></li> <li>Google Cal feeds</li> <li>Google spreadsheets</li> <li>Twitter</li> <li>Dropbox markdown files</li> <li>Github repo of markdown files</li> </ul> "}