{"layout":"page","title":"Static benefits","header":"Pages","body":"<h2 id=\"the-problems-with-content-management-systems\">The problems with content management systems</h2>\n<h3 id=\"complexity-and-cost\">Complexity and Cost</h3>\n<p>Using Drupal or Wordpress requires software to be running on a server to dynamically build each page request. So every time a user wants to visit a page, the server has to build it first. The software that does this builds each page dynamically, and requires constant updates and has a lot of &quot;moving parts&quot;. The cost to keep all of those parts moving all the time is high. Therefore, the cost to host a website like this will be much more expensive than a static site.</p>\n<h3 id=\"constraints-on-content-creation\">Constraints on Content Creation</h3>\n<p>With a typical CMS, content can only be created via that website. The method for adding content was designed to be like a “desktop” type device that was connected to the internet. This approach was fine when everyone did everything on a desktop computer. But now content creators have all kinds of devices they like to use for content creation. A good example is the iPad. It’s clumsy editing content via a website, and it&#39;s a much nicer experience using a native app that is a content editor.</p>\n<h3 id=\"emphasis-on\">Emphasis on</h3>\n<p>WYSIWYM</p>\n<h2 id=\"why-switch-to-create-anywhere-publish-everywhere-cape-\">Why switch to Create Anywhere Publish Everywhere (CAPE)?</h2>\n<h3 id=\"performance\">Performance</h3>\n<p>Content rarely changes. It is a complete waste of resources to load a database and software to handle the processing it into the final html markup. It&#39;s difficult to get higher performance than serving static files. Dynamic content can be handled with various third party javascript libraries. Ever get a notice from your host that your website is using too many resources? CPU or Memory issues will be gone forever when your site is statically cached.</p>\n<h3 id=\"data-protection\">Data Protection</h3>\n<p>Own your content. If you use a blogging service like Tumblr you should have a backup of all your posts. Do you? CAPE accepts various sources of information and stores them in plain text files. They are easy to edit anywhere and can be published everywhere.</p>\n<h3 id=\"security\">Security</h3>\n<p>Serving static HTML is inherently safe. No server side scripts to get attacked, or abused. Anytime your site is being dynamically generated that software must be updated regularly or you are at risk for security vulnerabilities.</p>\n<h3 id=\"focus-on-the-content\">Focus on the content</h3>\n<p>Interfaces change, content remains. It&#39;s too difficult to have layout specific information in the content if you want to display the content in more than one place. The content needs to be <strong>presentation agnostic</strong>. One of the greatest things about the Web is its universality. Web-enabled devices are everywhere. Your content should be accessible from any device. A Content Management System should focus on <strong>managing content</strong>. </p>\n<h3 id=\"responsive-design\">Responsive Design</h3>\n<p>The web is responsive by nature. Responsive design gets really difficult to accomplish when there is display rules mixed in with the content. Often times layout breaks on certain devices or layouts. It&#39;s impossible to test for all the possibilities. Design for the flexibility and the unknown.</p>\n<h3 id=\"versatility\">Versatility</h3>\n<p>Desktop applications, web applications, mobile applications. All devices can by sources of content. Why limit yourself to creating content to a single place focused toward a single device.</p>\n<h3 id=\"don-t-repeat-yourself-or-reinvent-the-wheel\">Don&#39;t Repeat Yourself or Reinvent the Wheel</h3>\n<p>Don&#39;t Repeat Yourself (DRY) is a principle of software development aimed at reducing repetition of information of all kinds. To reinvent the wheel is to duplicate a basic method that has already previously been created or optimized by others. We think that CAPE helps website users and managers avoid both of these pitfalls.</p>\n<h3 id=\"drupal-is-slow-and-complicated\">Drupal is Slow and Complicated</h3>\n<p>You&#39;ll only be as good as the mean of those around you. The Drupal community is home to many semi-developer freelancers. Drupal enables a ton of functionality without being a programmer. Need some added functionality? There is a module for that. A module that could have been written for a specific job and the maintainer is no longer getting paid to work on it.</p>\n<h4 id=\"drupal-is-good-for-two-main-groups\">Drupal is good for two main groups</h4>\n<ol>\n<li><p>Small scale site builders who can leverage the power of Views, Fields, and the rich module ecosystem but aren&#39;t building sites complex enough to land them in &quot;maintenance hell&quot;.</p>\n</li>\n<li><p>Large organizations with small development teams that need a complex content/user model. Drupal does a good job of content modeling, revisions, localization, and has a decent plugin system.</p>\n</li>\n</ol>\n<h4 id=\"the-simple-things\">The simple things</h4>\n<p>Say you want to show a specific set of characters in a post. Not easy when there is html involved. You have to exclude the html from the count.</p>\n"}